trail-master-backend/app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "content", "trail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New"], ["content", "Comment"], ["trail_id", 4], ["created_at", "2020-07-09 20:15:26.510961"], ["updated_at", "2020-07-09 20:15:26.510961"]]
---
    def create
        @comment = Comment.new(comment_params)

        if @comment.save