trail-master-backend/app/controllers/trails_controller.rb

  def index
    trails = Trail.all
---
SELECT "trails".* FROM "trails"

  def create
    @trail = Trail.new(trail_params)

    if @trail.save
---
INSERT INTO "trails" ("name", "start_location", "end_location", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["start_location", ""], ["end_location", ""], ["image_url", "images/stock_trail.jpeg"], ["created_at", "2020-07-10 16:40:41.720424"], ["updated_at", "2020-07-10 16:40:41.720424"]]

  def update
    if @trail.update(trail_params)
---
UPDATE "trails" SET "difficulty" = $1, "completion_time" = $2, "elevation_gain" = $3, "updated_at" = $4 WHERE "trails"."id" = $5  [["difficulty", 3], ["completion_time", "48"], ["elevation_gain", 2543], ["updated_at", "2020-07-09 15:22:44.056357"], ["id", 8]]

  def destroy
    @trail.destroy
---
DELETE FROM "trails" WHERE "trails"."id" = $1  [["id", 4]]

    def set_trail
      @trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]